report/Report.tex
% Created 2022-11-17 Thu 22:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{190022658}
\date{\today}
\title{CS4203 P2 - Report}
\hypersetup{
 pdfauthor={190022658},
 pdftitle={CS4203 P2 - Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Overview}
\label{sec:org4fcbab9}
In this practical, we needed to create a secure messaging system which consists of:
\begin{enumerate}
\item the client with which the users interact;
\item a server or broker that puts the clients in touch with each other;
\item a crypto infrastructure that ties everything together.
\end{enumerate}

I created all three components in JavaScript.

\section{Design}
\label{sec:orgea76752}
The libraries used were tls, fs and crypto. I chose JavaScript because the documentation was easy to read and was filled with example. I also had experience in building client and server in JavaScript.
There are two components for a messaging application, client and server.
\subsection{Security}
\label{sec:org0d77502}
The components here are tls, certificates and encryption.
\subsubsection{Crypto}
\label{sec:org9b86112}
I used the crypto module in nodejs for encryption. The type of encryption I chose was assymetric key encryption. The key pair were generated using the generateKeyPairSync from the crypto module. This was generated when the client started and the public key was sent to the server upon login. I used the privateDecrypt and publicEncrypt methods to perform the encryption. These implementation are in utils/crypto.js.
\subsubsection{TLS}
\label{sec:orgccbdd95}
I used the tls module in nodejs to connect the server and clients instead of the net module. This adds a layer of security creating a secure communication channel between the client and the server. The certificate creation process is shown in the README.

\subsection{Server}
\label{sec:org4368ce4}
The server has a list of all users (as User objects) which contain the usernames, public keys and sockets. The program uses event listeners from tls server and sockets. It then utilizes those to create new Users (login), send messages, send public keys and sending errors.

\subsection{Client}
\label{sec:orgbf0fcb7}
The client keeps all public keys to encrypt the data and uses its own private key to decrypt messages that it receives. It also uses event listeners from tls socket to send message to server, receive publickeys and login.

For ease, the messages sent are of certain types. They are the following form:
\begin{verbatim}
Message = {
    type: "login" / "message" / "keyinfo",
    // login
    username,
    publicKey

    // message
    receiver,
    text
}
\end{verbatim}

\section{Functionality and Testing}
\label{sec:org9681ec2}
\subsection{Login}
\label{sec:org02610a6}
\begin{verbatim}
> p2@1.0.0 client /cs/home/es299/Documents/CS4203/P2
> node client.js

Enter your username: adi

To message someone       - @<username> message
To refresh public keys   - /refresh
To exit                  - /exit

>> Server: Hello from server, adi!
\end{verbatim}

\subsection{Sending a message to a non-existant user}
\label{sec:orgda7d9f5}
\begin{verbatim}
>> Server: Hello from server, adi!
@someone hi
>> User not online, try /refresh
\end{verbatim}

\subsection{Sending a message to a user without having its public key}
\label{sec:orgc9b3c46}
\begin{verbatim}
-- client 1 --
Enter your username: eeee

To message someone       - @<username> message
To refresh public keys   - /refresh
To exit                  - /exit

>> Server: Hello from server, eeee!

-- client 2 --
>> Server: User connected: eeee
@eeee hi
>> User not online, try /refresh
\end{verbatim}

\subsection{Sending a valid message}
\label{sec:orgef29b95}
\begin{verbatim}
-- client 1 --
Enter your username: eeee

To message someone       - @<username> message
To refresh public keys   - /refresh
To exit                  - /exit

>> Server: Hello from server, eeee!

-- client 2 --
/refresh
>> Keys refreshed!
>> Users online:
>>    adi
>>    eeee
@eeee hello!

-- client 1 --
...
>> Server: Hello from server, eeee!
>> adi: hello!
\end{verbatim}

\subsection{Shows when a new user has logged in}
\label{sec:orgcf59003}
\begin{verbatim}
Enter your username: adi

To message someone       - @<username> message
To refresh public keys   - /refresh
To exit                  - /exit

>> Server: Hello from server, adi!
>> Server: User connected: eeee
\end{verbatim}

\subsection{Exit}
\label{sec:org3d34875}
\begin{verbatim}
>> eeee: hello!
>> adi: hi!
/exit
\end{verbatim}

\subsection{Show when user disconnects}
\label{sec:org0f22307}
\begin{verbatim}
-- client --
>> adi: hello!
>> Server: User disconnected: adi
\end{verbatim}

\subsection{Server closes}
\label{sec:org675c67b}
All the clients exit in this case.
\section{Evaluation}
\label{sec:org16f9762}
Man in the middle attack has been prevented by the use of tls. Non-repudiability has not been implementated, to implement this the sign and verify methods can be used from the crypto module. Messages cannot be read on the server since the server only receives encryted data and does not have the private keys to decrypt them. It's important to ensure that the server database is secure, incase the public key is changed.
\section{Conclusion}
\label{sec:org25e1935}
This practical was challenging to start out with, but got easier. If I had more time, I would have implemented non-repudiability and database with user passwords. I would also have added a queue to save the messages and user credentials. The last thing would have been to send all the existing public keys to the user when they register and send public key of the user when they register. This would completely remove the use of '/refresh' command and would make it easy to implement non-repudiability.
\end{document}
